In [2]:
import pandas as pd;import numpy as np

In [3]:
s1 = pd.Series(np.arange(4),index=["a","c","d","e"])
s2 = pd.Series(np.arange(5),index=["a","c","e","f","g"])

In [4]:
print(s1)
print(s2)

a    0
c    1
d    2
e    3
dtype: int32
a    0
c    1
e    2
f    3
g    4
dtype: int32

In [6]:
#indexleri karşılıklı olarak eşleşen veriler toplandı eşleşmeyenler ise NaN değer aldı 
s1+s2

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

In [7]:
#aynı durum dataFrame veri yapıları için de geçerlidir
df1 = pd.DataFrame(np.arange(6).reshape(2,3),columns=list("ABC"),index=["ali","efe"])
df2 = pd.DataFrame(np.arange(9).reshape(3,3),columns=list("ACD"),index=["ali","can","efe"])

In [10]:
print(df1)
print("\n************\n")
print(df2)

     A  B  C
ali  0  1  2
efe  3  4  5

************

     A  C  D
ali  0  1  2
can  3  4  5
efe  6  7  8

In [12]:
#burada da kesişmelere bakacağız örneğin alinin df1 de a değeri ile df2 de a değeri var bunların toplamı alınacak ama alinin df2 de b değeri
#yok bu yüzden NaN değer
df1+df2

       A   B     C   D
ali  0.0 NaN   3.0 NaN
can  NaN NaN   NaN NaN
efe  9.0 NaN  12.0 NaN

In [13]:
#df1 ile df2 toplanır , df1 de d sütunu olmadığı için tabloda d yerine 0 , df2 de de b olmadığı için tabloda onun yerine de 0 yazılır ve işlem
#ona göre yapılır
df1.add(df2,fill_value=0)

       A    B     C    D
ali  0.0  1.0   3.0  2.0
can  3.0  NaN   4.0  5.0
efe  9.0  4.0  12.0  8.0

In [14]:
#çarpmaya göre tersi alınabilir
1/df1

            A     B    C
ali       inf  1.00  0.5
efe  0.333333  0.25  0.2

In [15]:
#çarpma işlemi için aşağıdaki iki yol da uygulanabilir
df1*3
df1.mul(3)

     A   B   C
ali  0   3   6
efe  9  12  15

In [16]:
df2

     A  C  D
ali  0  1  2
can  3  4  5
efe  6  7  8

In [19]:
#df2 dataFrame'inin 1. indeksinin verilerini s değişkenine atadık ve bir seri oluşturduk
s = df2.iloc[1]

#df2 den bu seriyi çıkardığımızda çıkarma işlemi eşleşen indexler üzerinden olacak ve tüm satırlara uygulanacak 
df2 - s

     A  C  D
ali -3 -3 -3
can  0  0  0
efe  3  3  3

In [21]:
#bu işlemi sütun bazında yapmak için 
s2=df2["A"]
s2

ali    0
can    3
efe    6
Name: A, dtype: int32

In [22]:
#df2 - s2 anlamına geliyor ve karşılıklı sütunlar ile işlem yapabilmek için axis = index dedik 
df2.sub(s2,axis='index')

     A  C  D
ali  0  1  2
can  0  1  2
efe  0  1  2

## Bir fonksiyonu uygulamak

In [24]:
#numpy fonksiyonları pandas ile senkronize çalışır
vs = pd.DataFrame(np.random.randn(4,3),columns=list("ABC"),index=["ali","berk","can","efe"])
vs

             A         B         C
ali  -2.201458  0.054942 -0.848334
berk -0.954367  1.504277 -1.051803
can  -0.192803  0.866147  0.009591
efe   1.505671  1.250686  0.291350

In [25]:
#numpyda kullanılan mutlak değer alma fonksiyonu ile yukarıdaki tablonun mutlak değerini alabiliriz
np.abs(vs)

             A         B         C
ali   2.201458  0.054942  0.848334
berk  0.954367  1.504277  1.051803
can   0.192803  0.866147  0.009591
efe   1.505671  1.250686  0.291350

In [27]:
#aşağıda bir lambda fonksiyonu oluşturuyoruz
f = lambda x : x.max() - x.min()

In [28]:
#vs dataFrame'ine yukarıdaki kuralı uygulattık ama sütun bazında max ve minlerle işlem yaptı
vs.apply(f)

A    3.707129
B    1.449335
C    1.343153
dtype: float64

In [30]:
#satır bazında işlem için
vs.apply(f,axis=1)

ali     2.256401
berk    2.556080
can     1.058950
efe     1.214321
dtype: float64

In [31]:
#kendi oluşturduğumuz fonksiyonu da dataFrame'e uygulayabiliriz, aşağıda kare alan bir fonksiyon var
def kare(x):
    return x**2

vs.apply(kare)

             A         B         C
ali   4.846419  0.003019  0.719671
berk  0.910817  2.262849  1.106291
can   0.037173  0.750210  0.000092
efe   2.267045  1.564215  0.084885